using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace JobWanted
{
    /// <summary>
    /// 区域编码数据
    /// </summary>
    public class CodesData
    {
        #region  0:智联 1:前程 2:猎聘
        public static Dictionary<string, string[]> codes = new Dictionary<string, string[]>();
        /// <summary> 
        /// 获取区域编码
        /// </summary>
        /// <param name="city">区域（中文）</param>
        /// <param name="type">类型（0:【智联】1:【前程】2:【猎聘】）3:【BOSS】</param>
        /// <returns></returns>
        public static string GetCityCode(RecruitEnum type, string city)
        {
            city = city.Trim().TrimEnd('市');
            if (codes.Count <= 0)
            {
                codes.Add("北京", new[] { "530", "010000", "010", "101010100" });
                codes.Add("上海", new[]  { "538", "020000", "020", "101020100" });
                codes.Add("深圳", new[]  { "765", "040000", "050090", "101280600" });
                codes.Add("广州", new[]  { "763", "030200", "050020", "101280100" });
                codes.Add("杭州", new[]  { "653", "080200", "070020", "101210100" });
                codes.Add("成都", new[]  { "801", "090200", "280020", "101270100" });
                codes.Add("南京", new[]  { "635", "070200", "060020", "101190100" });
                codes.Add("武汉", new[]  { "736", "180200", "170020", "101200100" });
                codes.Add("西安", new[]  { "854", "200200", "270020", "101110100" });
                codes.Add("厦门", new[]  { "682", "110300", "090040", "101230200" });
                codes.Add("长沙", new[]  { "749", "190200", "180020", "101250100" });
                codes.Add("苏州", new[]  { "639", "070300", "060080", "101190400" });
                codes.Add("天津", new[]  { "531", "050000", "030", "101030100" });
                codes.Add("重庆", new[]  { "551", "060000", "040", "101040100" });
                codes.Add("郑州", new[]  { "719", "170200", "150020", "101180100" });
                codes.Add("青岛", new[]  { "703", "120300", "250070", "101120200" });
                codes.Add("合肥", new[]  { "664", "150200", "080020", "101220100" });
                codes.Add("福州", new[]  { "542", "110200", "090020", "101230100" });
                codes.Add("济南", new[]  { "702", "120200", "250020", "101120100" });
                codes.Add("大连", new[]  { "600", "230300", "210040", "101070200" });
                codes.Add("珠海", new[]  { "766", "030500", "050140", "101280700" });
                codes.Add("无锡", new[]  { "636", "070400", "060100", "101190200" });
                codes.Add("佛山", new[]  { "768", "030600", "050050", "101280800" });
                codes.Add("东莞", new[]  { "779", "030800", "050040", "101281600" });
                codes.Add("宁波", new[]  { "654", "080300", "070030", "101210400" });
                codes.Add("常州", new[]  { "638", "070500", "060040", "101191100" });
                codes.Add("沈阳", new[]  { "599", "230200", "210020", "101070100" });
                codes.Add("石家庄", new[]  { "565", "160200", "140020", "101090100" });
                codes.Add("昆明", new[]  { "831", "250200", "310020", "101290100" });
                codes.Add("南昌", new[]  { "691", "130200", "200020", "101240100" });
                codes.Add("南宁", new[]  { "785", "140200", "110020", "101300100" });
                codes.Add("哈尔滨", new[]  { "622", "220200", "160020", "101050100" });
                codes.Add("海口", new[]  { "799", "100200", "130020", "101310100" });
                codes.Add("中山", new[]  { "780", "030700", "050130", "101281700" });
                codes.Add("惠州", new[]  { "773", "030300", "050060", "101280300" });
                codes.Add("贵阳", new[]  { "822", "260200", "120020", "101260100" });
                codes.Add("长春", new[]  { "613", "240200", "190020", "101060100" });
                codes.Add("太原", new[]  { "576", "210200", "260020", "101100100" });
                codes.Add("嘉兴", new[]  { "656", "080700", "070090", "101210300" });
                codes.Add("泰安", new[]  { "710", "121100", "250090", "101120800" });
                codes.Add("昆山", new[]  { "640", "070600", "060050", "101191400" });
                codes.Add("烟台", new[]  { "707", "120400", "250120", "101120500" });
                codes.Add("兰州", new[]  { "864", "270200", "100020", "101160100" });
                codes.Add("泉州", new[]  { "685", "110400", "090030", "101230500" });
            }
            if (codes.Keys.Contains(city))
                return codes[city][(int)type];
            return null;
        }
        #endregion
    }
}
